let arrObj = [
    {
        "id": 1,
        "title": "Пираты Карибского моря: проклятие черной жемчужины",
        "year": 2003,
        "country": "США",
        "genre": "фэнтези, боевик, приключение",
        "duration": "02:23:12",
        "rating" : 8.3,
        "producer": {
            "name": "Гор Вербински",
            "birthday": "16.03.1964",
            "country": "США",
            "number_of_films": 23,
            "average_rating": 7.29,
            "genres": "фэнтези, боевик, приключение, комедия"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/4374.jpg",
        "about_film": "Жизнь харизматичного авантюриста, капитана Джека Воробья, полная увлекательных приключений, резко меняется, когда его заклятый враг — капитан Барбосса — похищает корабль Джека, Черную Жемчужину, а затем нападает на Порт Ройал и крадет прекрасную дочь губернатора, Элизабет Суонн."
    },
    {
        "id": 2,
        "title": "Принц Персии: Пески времени",
        "year": 2010,
        "country": "США",
        "genre": "фэнтези, боевик, мелодрама, приключение",
        "duration": "01:55",
        "rating" : 7.4,
        "producer": {
            "name": "Майк Ньюэлл",
            "birthday": "28.03.1942",
            "country": "Великобритания",
            "number_of_films": 97,
            "average_rating": 7.21,
            "genres": "драма, мелодрама, комедия"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/195394.jpg",
        "about_film":"Главный герой этой экранизации культовой компьютерной игры, юный принц Дастан всегда побеждал врагов в бою, но потерял королевство из-за козней коварного царедворца. Теперь Дастану предстоит похитить из рук злодеев могущественный магический артефакт, способный повернуть время вспять и сделать своего владельца властелином мира. Помочь одолеть врагов Дастану помогут его блестящие навыки владения холодным оружием, а также недюжинные способности к акробатике и эквилибристике."
    },
    {
        "id": 3,
        "title": "Гладиатор",
        "year": 2000,
        "country": "США, Великобритания",
        "genre": "фэнтези, драма, приключение",
        "duration": "02:35",
        "rating" : 8.6,
        "producer": {
            "name": "Ридли Скотт",
            "birthday": "30.11.1937",
            "country": "Великобритания",
            "number_of_films": 240,
            "average_rating": 6.9,
            "genres": "драма, триллер, фантастика"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/474.jpg",
        "about_film": "В великой Римской империи не было военачальника, равного генералу Максимусу. Непобедимые легионы, которыми командовал этот благородный воин, боготворили его и могли последовать за ним даже в ад. Но случилось так, что отважный Максимус, готовый сразиться с любым противником в честном бою, оказался бессилен против вероломных придворных интриг. Генерала предали и приговорили к смерти. Чудом избежав гибели, Максимус становится гладиатором."
    },
    {
        "id": 4,
        "title": "Хористы",
        "year": 2004,
        "country": "Франция, Швейцария, Германия",
        "genre": "драма, музыка",
        "duration": "01:35",
        "rating" : 8.3,
        "producer": {
            "name": "Кристоф Барратье",
            "birthday": "17.06.1963",
            "country": "Франция",
            "number_of_films": 29,
            "average_rating": 7.8,
            "genres": "документальный, драма, музыка"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/51481.jpg",
        "about_film": "Франция, 1949 год. Отчаявшись найти работу, учитель музыки Клемент Матье попадает в интернат для трудных подростков. Там он видит, к каким жестоким «воспитательным мерам» прибегает ректор этого заведения Рашан. Чем больше издевается Рашан над мальчиками, тем агрессивнее они становятся.Добродушного по натуре Матье возмущают эти методы, но он не в состоянии открыто протестовать. Но однажды ему, автору многочисленных музыкальных произведений, которые он скромно прячет в своей комнате, приходит в голову замечательная идея: организовать школьный хор."
    },
    {
        "id": 5,
        "title": "Троя",
        "year": 2004,
        "country": "США, Мальта, Великобритания",
        "genre": "боевик, драма, мелодрама, история",
        "duration": "02:43",
        "rating" : 8.0,
        "producer": {
            "name": "Вольфганг Петерсен",
            "birthday": "14.03.1941",
            "country": "Германия",
            "number_of_films": 62,
            "average_rating": 7.32,
            "genres": "драма, триллер, боевик"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/3442.jpg",
        "about_film": "1193 год до нашей эры. Парис украл прекрасную Елену, жену царя Спарты Менелая. За честь Менелая вступается его брат — царь Агамемнон. Его армия под предводительством Ахиллеса подошла к Трое и взяла город в кровавую осаду, длившуюся долгих десять лет… Два мира будут воевать за честь и власть. Тысячи умрут за славу. И за любовь нация сгорит дотла."
    },
    {
        "id": 6,
        "title": "Гордость и предубеждение",
        "year": 2005,
        "country": "Франция, Великобритания, США",
        "genre": "драма, мелодрама",
        "duration": "02:09",
        "rating" : 8.0,
        "producer": {
            "name": "Джо Райт",
            "birthday": "25.08.1972",
            "country": "Великобритания",
            "number_of_films": 41,
            "average_rating": 7.28,
            "genres": "	драма, короткометражка, триллер"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/81733.jpg",
        "about_film": "Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. И потому размеренная жизнь солидного семейства переворачивается вверх дном, когда по соседству появляется молодой джентльмен — мистер Бингли… "
    },
    {
        "id": 7,
        "title": "Агора",
        "year": 2009,
        "country": "Испания",
        "genre": "драма, приключения, история",
        "duration": "02:06",
        "rating" : 7.6,
        "producer": {
            "name": "Алехандро Аменабар",
            "birthday": "31.03.1972",
            "country": "Чили",
            "number_of_films": 49,
            "average_rating": 7.34,
            "genres": "	триллер, драма, короткометражка"
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/405952.jpg",
        "about_film": "Действие происходит в Александрии (Египет), в конце эпохи Римской империи. Христианство набирает популярность и, опираясь на низы общества, становится политической силой. В это переломное время живёт философ, математик и астроном Гипатия, имеющая большое влияние на умы правителей."
    },
    {
        "id": 8,
        "title": "Аватар",
        "year": 2009,
        "country": "Великобритания, США",
        "genre": "фантастика, боевик",
        "duration": "02:42",
        "rating" : 7.9 ,
        "producer": {
            "name": "Джеймс Кэмерон",
            
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/251733.jpg",
        "about_film": "Джейк Салли — бывший морской пехотинец, прикованный к инвалидному креслу. Несмотря на немощное тело, Джейк в душе по-прежнему остается воином. Он получает задание совершить путешествие в несколько световых лет к базе землян на планете Пандора, где корпорации добывают редкий минерал, имеющий огромное значение для выхода Земли из энергетического кризиса."
    },
    {
        "id": 9,
        "title": "Начало",
        "year": 2010,
        "country": "Великобритания, США",
        "genre": "фантастика, боевик",
        "duration": "02:28",
        "rating" : 8.6 ,
        "producer": {
            "name": "Кристофер Нолан",
            
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/447301.jpg",
        "about_film":`Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. 
        И вот у Кобба появляется шанс исправить ошибки. Его последнее дело может вернуть все назад, но для этого ему нужно совершить невозможное — инициацию. Вместо идеальной кражи Кобб и его команда спецов должны будут провернуть обратное. Теперь их задача — не украсть идею, а внедрить ее. Если у них получится, это и станет идеальным преступлением. 
        `
    },
    {
        "id": 10,
        "title": "Железный человек 2",
        "year": 2010,
        "country": "США",
        "genre": "фантастика, боевик",
        "duration": "02:05",
        "rating" : 7.5 ,
        "producer": {
            "name": "Джон Фавро",
            
        },
        "poster": "https://www.kinopoisk.ru/images/film_big/411924.jpg",
        "about_film":`Прошло полгода с тех пор, как мир узнал, что миллиардер-изобретатель Тони Старк является обладателем уникальной кибер-брони Железного человека. Общественность требует, чтобы Старк передал технологию брони правительству США, но Тони не хочет разглашать её секреты, потому что боится, что она попадёт не в те руки. 
        Между тем Иван Ванко — сын русского учёного, когда-то работавшего на фирму Старка, но потом уволенного и лишенного всего, намерен отомстить Тони за беды своей семьи. Для чего сооружает своё высокотехнологичное оружие.`
    }
]

